Repository: skwasjer/IbanNet
Catalog: src/IbanNet/Resources.*.resx
Languages: ca, de, nl

# IbanFormatException_The_value_0_is_not_a_valid_IBAN
source: The value '{0}' is not a valid IBAN.
ca: El valor '{0}' no és un IBAN vàlid.
de: Der Wert '{0}' ist keine gültige IBAN.
nl: De waarde '{0}' is geen geldige IBAN.

# ArgumentException_The_format_is_required_with_supported_formats
source: The format is required. Supported formats are '{0}' (flat) and '{1}' (partitioned by space).
nl: Format is verplicht. Ondersteunde formaten zijn '{0}' (flat) and '{1}' (partitioned by space).

# ArgumentException_The_format_0_is_invalid_with_supported_formats
source: The format '{0}' is invalid. Supported formats are '{1}' (flat) and '{2}' (partitioned by space).
nl: Het format '{0}' is niet valide. Ondersteunde formaten zijn '{1}' (flat) en '{2}' (partitioned by space).

# ArgumentException_The_format_0_is_invalid
source: The format '{0}' is invalid.
ca: El format '{0}' no és vàlid.
de: Das Format '{0}' ist ungültig.
nl: Het format '{0}' is niet valide.

# ArgumentException_Registry_is_required
source: Provide the registry.
ca: Cal proporcionar el registre.
de: Es wird ein Register benötigt.
nl: Registry is verplicht

# ArgumentException_Invalid_country_code
source: Invalid country code. must be exactly two characters long.
ca: Codi de país no vàlid, entreu codi de dues lletres.
de: Ungültiger Ländercode, es wird ein Code mit genau zwei Buchstaben erwartet.
nl: Incorrecte landcode, code moet exact twee tekens lang zijn.

# IllegalCharactersResult
source: The IBAN contains illegal characters.
ca: l'IBAN conté caràcters no vàlids.
de: Die IBAN enthält unzulässige Zeichen.
nl: Dit IBAN bevat niet toegestane tekens.

# InvalidCheckDigitsResult
source: The IBAN check digits are incorrect.
ca: Els dígits de control de l'IBAN no són correctes.
de: Die IBAN-Prüfziffern sind falsch.
nl: De 'check digits' van deze IBAN zijn incorrect.

# InvalidLengthResult
source: The IBAN has an incorrect length.
ca: L'IBAN te una llargada incorrecta.
de: Die IBAN hat eine falsche Länge.
nl: Dit IBAN heeft een ongeldige lengte.

# InvalidStructureResult
source: The structure of the IBAN is incorrect.
ca: El patró de l'IBAN no és correcte.
de: Das Muster der IBAN ist nicht korrekt.
nl: De structuur van dit IBAN is ongeldig.

# UnknownCountryCodeResult
source: The country code is unknown/not supported.
ca: El codi de país és desconegut o no suportat.
de: Der Ländercode ist unbekannt oder wird nicht unterstützt.
nl: Deze landcode is onbekend of niet ondersteund.

# ArgumentException_The_structure_segment_0_is_invalid
source: The pattern segment '{0}' is invalid at position {1}.
nl: Het segment '{0}' is invalide op positie {1}.

# InvalidTokenException_Expected_alphanumeric_character_at_position_0_but_found_1
source: Expected alphanumeric character at position {0}, but found '{1}'.
ca: S'espera caràcter alfanumèric a la posició {0}, però s'ha trobat '{1}'.
de: Erwartetes alphanumerisches Zeichen an Position {0}, aber '{1}' gefunden.
nl: Een alfa-numeriek teken was verwacht op {0}, waar het was '{1}'.

# PartitionOn_At_least_one_character_to_partition_on_is_required
source: At least one character to partition on is required.
ca: Al menys cal un caràcter de partició.
de: Es wird mindestens ein Zeichen zum Partitionieren benötigt.
nl: Tenministe één teken om op te partitioneren is verplicht.

source: The registry has no providers.
ca: El registre no te proveïdors.
de: Das Register hat keine Provider.
nl: Het Registry heeft geen Providers.

source: One or more providers is required.
ca: Calen un o més proveïdors de registre.
de: Einer oder mehrere Provider sind erforderlich.
nl: Een of meer providers is verplicht.

# ArgumentException_The_country_code_0_is_not_registered
source: The country code '{0}' is not registered.
ca: El codi de país '{0}' no està enregistrat.
de: Der Ländercode '{0}' ist nicht registriert.
nl: De landcode '{0}' is niet geregistreerd.

# Exception_Builder_The_BBAN_cannot_be_built
source: The BBAN cannot be built.
ca: No es pot construïr el BBAN.
de: Die BBAN kann nicht erstellt werden.
nl: De BBAN kon niet worden opgebouwd.

# Exception_Builder_The_IBAN_cannot_be_built
source: The IBAN cannot be built.
ca: No es pot construïr l'IBAN.
de: Die IBAN kann nicht erstellt werden.
nl: Het IBAN kon niet worden opgebouwd.

# Exception_Builder_A_value_for_0_is_not_supported_for_country_code_1
source: A value for '{0}' is not supported for country code {1}.
ca: El valor '{0}' no s'admet pel codi de país {1}.
de: Ein Wert für '{0}' wird für den Ländercode {1} nicht unterstützt.
nl: Waarde '{0}' is niet ondersteund voor landcode {1}.

# Exception_Builder_The_value_0_does_not_have_the_correct_length_of_1
source: The value '{0}' does not have the correct length of {1}.
ca: El valor '{0}' no te la longitud correcta {1}.
de: Der Wert '{0}' hat nicht die richtige Länge von {1}.
nl: De waarde '{0}' heeft niet de correcte lengte van {1}.

# Exception_Builder_The_country_is_required
source: The country is required.
ca: El país és obligatori.
de: Das Land wird benötigt.
nl: Het land is verplicht.

source: The value cannot be less than {0}.
ca: El valor no pot ser inferior a {0}.
de: Der Wert darf nicht kleiner als {0} sein.
nl: De waarde kan niet minder zijn dan {0}.

source: The value cannot be less than or equal to {0}.
ca: El valor no pot ser inferior o igual a {0}.
de: Der Wert darf nicht kleiner oder gleich {0} sein.
nl: De waarde kan niet minder dan- of gelijk zijn aan {0}.

source: Enum value '{0}' should be defined in the '{1}' enum.
de: Der Enum-Wert '{0}' sollte im Enum '{1}' definiert sein.
nl: Enum waarde '{0}' dient gedefinieerd te zijn in de '{1}' enum.

# Exception_The_country_0_does_not_define_a_BBAN_pattern
source: The country '{0}' does not define a BBAN pattern.
ca: El país '{0}' no defineix un patró BBAN.
de: Das Land '{0}' definiert kein BBAN-Muster.
nl: Het land '{0}' heeft geen BBAN-patroon gedefinieerd.

# Exception_The_country_0_does_not_define_a_IBAN_pattern
source: The country '{0}' does not define a IBAN pattern.
ca: El país '{0}' no defineix un IBAN vàlid.
de: Das Land '{0}' definiert kein IBAN-Muster.
nl: Het land '{0}' heeft geen IBAN-patroon gedefinieerd.

# CountryNotAcceptedResult_Bank_account_numbers_from_country_0_are_not_accepted
source: Bank account numbers from country {0} are not accepted.
ca: Els comptes bancaris del país {0} no s'accepten.
de: Bankkontonummern aus dem Land {0} werden nicht akzeptiert.
nl: Bankrekeningnummers van het land {0} worden niet geaccepteerd.

# ArgumentException_At_least_one_country_code_must_be_provided
source: At least one country code must be provided.
ca: S'ha d'indicar al menys un codi de país.
de: Mindestens ein Ländercode muss angegeben werden.
nl: Tenminste één landcode moet worden opgegeven.

# IllegalCountryCodeCharactersResult
source: The IBAN contains illegal characters in the position where the country code is expected.
ca: L'IBAN conté caràcters no permesos a la posició del codi de país.
de: Die IBAN enthält unzulässige Zeichen an der Stelle, an der der Ländercode erwartet wird.
